/**
 * Игровой интерфейс!
 * Описываем абстрактные методы которые д.б. обязательно реализованы в класах реализуемых этим интерфейсом
 * все методы описанные в интерфейсе публичные (и должны быть обязательно реализованы!)
 * Описываем методы для возвращения без параметров
 * для добавления методов и последующих их добавлениях (удобно дописывать методы, без множества изменених и поисков в др.классах)
 */
package org.example.units;

import java.util.ArrayList;

public interface GameInterface {
    // эти методы абстрактные по умолчанию, т.к. они в public interface:
    void step(ArrayList<BaseHero> team1, ArrayList<BaseHero> team2);         // метод передвижения для всех объектов всех классов
    StringBuilder getInfo();      // метод инфы для всех объектов всех классов
}